//Сдесь хранятся все кадры и сценки игры , никаких функций и скриптов ! 



//
var NEWGAME_BUTTON_1 = "   1. Начать игру\n";
var NEWGAME_BUTTON_2 = "///1. Начать игру///\n////////////////////";

var OPTIONS_BUTTON_1 = "   2. Настройки\n";
var OPTIONS_BUTTON_2 = "///2. Настройки//\n/////////////////";

var TITLES_BUTTON_1 = "  3. Титры \n";
var TITLES_BUTTON_2 = "//3. Титры///\n/////////////";

var CHANGELOG_BUTTON_1 = "  4. Список обновлений / изменений\n";
var CHANGELOG_BUTTON_2 = "//4. Список обновлений / изменений///\n/////////////////////////////////////"

var OPTIONS_BACK_BUTTON_1 = "                                        Выйти  обратно                               \n";
var OPTIONS_BACK_BUTTON_2 = "////////////////////////////////////////Выйти  обратно//////////////////////////////////////////\n////////////////////////////////////////////////////////////////////////////////////////////////";

var OPTIONS_SAVE_BUTTON_1 = "           1. Загрузить данные                  ";
var OPTIONS_SAVE_BUTTON_2 = "///////////1. Загрузить данные//////////////////\n////////////////////////////////////////////////";

var OPTIONS_LOAD_BUTTON_1 = "                  2. Сохранить данные";
var OPTIONS_LOAD_BUTTON_2 = "//////////////////2. Сохранить данные//////////////\n///////////////////////////////////////////////////";

var OPTIONS_SOUND_BUTTON_1 = "   Нажмите чтобы\n     проверить";
var OPTIONS_SOUND_BUTTON_2 = "///Нажмите чтобы//\n/////проверить////";

var OPTIONS_SEND_BUTTON_1 = "      Отправить";
var OPTIONS_SEND_BUTTON_2 = "//////Отправить/////\n////////////////////";

var TITLES_BACK_BUTTON_1 = "                                        Выйти  обратно                               \n";
var TITLES_BACK_BUTTON_2 = "////////////////////////////////////////Выйти  обратно//////////////////////////////////////////\n////////////////////////////////////////////////////////////////////////////////////////////////";

var CHANGELOG_BACK_BUTTON_1 = "                                        Выйти  обратно                               \n";
var CHANGELOG_BACK_BUTTON_2 = "////////////////////////////////////////Выйти  обратно//////////////////////////////////////////\n////////////////////////////////////////////////////////////////////////////////////////////////";

var TITLES_PAGE_AREA_1 = "  Страница:\n      1";
var TITLES_PAGE_AREA_2 = "  Страница:\n      2";
var TITLES_PAGE_AREA_3 = "  Страница:\n      3";
var TITLES_PAGE_AREA_4 = "  Страница:\n      4";
var TITLES_PAGE_AREA_5 = "  Страница:\n      5";
var TITLES_PAGE_AREA_6 = "  Страница:\n      6";

var CHANGELOG_PAGE_AREA_1 = "  Страница:\n      1";
var CHANGELOG_PAGE_AREA_2 = "  Страница:\n      2";
var CHANGELOG_PAGE_AREA_3 = "  Страница:\n      3";
var CHANGELOG_PAGE_AREA_4 = "  Страница:\n      4";
var CHANGELOG_PAGE_AREA_5 = "  Страница:\n      5";
var CHANGELOG_PAGE_AREA_6 = "  Страница:\n      6";

//Кадры опеннинга
var OP_1 = "\n\n\n\n\n\n\n\n\n      ты любишь кабачки?\n        ()         ()\n         \\  ____   /\n          \\/*~ *\\\\/\n           \\____//\n           //  \\\\";

//Настройки
var OPTIONS_1 = " ||                                                  || ||                2. Сохранить данные               ||\n ||                                                  || ||                                                  ||\n===============================================================================================================\n                                               Музыка / Звуки\n===============================================================================================================\n Регулирование громкости музыки           ||   Нажмите чтобы   ||               Регулирование громкости звуков\n   ◀| ▂ ▃ ▄ ▅ ▆ ▇ █ |▶               ||     проверить     ||                   ◀| ▂ ▃ ▄ ▅ ▆ ▇ █ |▶\n===============================================================================================================\n                                              Ввод особого кода\n===============================================================================================================\n                    ||                                                                    ||\n                    ||                                                                    ||\n                    ||                                                                    ||\n                    ||                                                                    ||\n                    ||                                                                    ||\n                    ||                                                                    ||\n                    ========================================================================\n                                          ||                     ||\n                                          ||      Отправить      ||\n                                          =========================";
//Музыка 
var OPTIONS_1_DOWN = "◀|";
var OPTIONS_1_UP = "|▶";
var OPTIONS_1_UP_LIGHT_1 = "|▷";
var OPTIONS_1_UP_LIGHT_2 = "|▷";
var OPTIONS_1_DOWN_LIGHT_1 = "◁|";
var OPTIONS_1_DOWN_LIGHT_2 = "◁|";
var OPTIONS_1_MUSIC_7 = " Регулирование громкости музыки \n   ◀| ▂ ▃ ▄ ▅ ▆ ▇ █ |▶ ";
var OPTIONS_1_MUSIC_6 = " Регулирование громкости музыки \n   ◀| ▂ ▃ ▄ ▅ ▆ ▇   |▶ ";
var OPTIONS_1_MUSIC_5 = " Регулирование громкости музыки \n   ◀| ▂ ▃ ▄ ▅ ▆      |▶ ";
var OPTIONS_1_MUSIC_4 = " Регулирование громкости музыки \n   ◀| ▂ ▃ ▄ ▅         |▶ ";
var OPTIONS_1_MUSIC_3 = " Регулирование громкости музыки \n   ◀| ▂ ▃ ▄            |▶ ";
var OPTIONS_1_MUSIC_2 = " Регулирование громкости музыки \n   ◀| ▂ ▃              |▶ ";
var OPTIONS_1_MUSIC_1 = " Регулирование громкости музыки \n   ◀| ▂                 |▶ ";
var OPTIONS_1_MUSIC_0 = " Регулирование громкости музыки \n   ◀|                    |▶ ";
//Звуки
var OPTIONS_1_SOUND_7 = "       Регулирование громкости звуков \n         ◀| ▂ ▃ ▄ ▅ ▆ ▇ █ |▶ ";
var OPTIONS_1_SOUND_6 = "       Регулирование громкости звуков \n         ◀| ▂ ▃ ▄ ▅ ▆ ▇   |▶ ";
var OPTIONS_1_SOUND_5 = "       Регулирование громкости звуков \n         ◀| ▂ ▃ ▄ ▅ ▆      |▶ ";
var OPTIONS_1_SOUND_4 = "       Регулирование громкости звуков \n         ◀| ▂ ▃ ▄ ▅         |▶ ";
var OPTIONS_1_SOUND_3 = "       Регулирование громкости звуков \n         ◀| ▂ ▃ ▄            |▶ ";
var OPTIONS_1_SOUND_2 = "       Регулирование громкости звуков \n         ◀| ▂ ▃              |▶ ";
var OPTIONS_1_SOUND_1 = "       Регулирование громкости звуков \n         ◀| ▂                 |▶ ";
var OPTIONS_1_SOUND_0 = "       Регулирование громкости звуков \n         ◀|                    |▶ ";

//Титры
var TITLES_PAGE_1 = "                                            ||              ||\n                                            ||              ||\n                                            ==================\n\n                                               Разработчики:\n                                               ------------\n                                                 SteinweR\n                                               ------------\n\n                                           Аниматоры / Художники:\n                                           ---------------------\n                                                 Zaer_Pro\n                                           ---------------------\n\n                                               Тестировщики:\n                                               ------------\n                                                 SteinweR\n                                                  Radio\n                                               ------------";
var TITLES_PAGE_2 = "";
var TITLES_PAGE_3 = "";
var TITLES_PAGE_4 = "";
var TITLES_PAGE_5 = "";
var TITLES_PAGE_6 = "";

var TITLES_PAGE_DOWN_1 = "   /-|\n  |--|\n   \\-|";
var TITLES_PAGE_DOWN_2 = "   /*|\n  |**|\n   \\*|";
var TITLES_PAGE_UP_1 = " |-\\\n |--|\n |-/" ;
var TITLES_PAGE_UP_2 = " |*\\\n |**|\n |*/";


//Список изменений
var CHANGELOG_PAGE_1 = "                                            ||              ||\n                                            ||              ||\n                                            ==================\n                                               7 мая 2021г.\n        (1)Добавлен функционал к кнопкам основного интерфейса меню , добавлен первый особый код.\n                                               8 мая 2021г.\n        (1)Добавлено динамическое перемещение между локациями , любые кнопки возвращения обратно\n                       привязываются к прошлой локации , какой бы она не была.\n                        (2)Добавлено 2 канала звуков и 2 канала музыки(зачем?).\n                                (3)Добавлены звуки к некоторым кнопкам.\n                                               9 мая 2021г.\n                                          (1)Всех с Днём Победы !\n      (2)Добавлена динамическая полоска загрузки(Она увеличивается в размере от кол-ва загружаемых объектов).\n                                    (3)Добавлена предзагрузка звуков игры.\n                            (4)Удалён второй музыкальный канал, за ненадобностью.";
var CHANGELOG_PAGE_2 = "";
var CHANGELOG_PAGE_3 = "";
var CHANGELOG_PAGE_4 = "";
var CHANGELOG_PAGE_5 = "";
var CHANGELOG_PAGE_6 = "";

var CHANGELOG_PAGE_DOWN_1 = "   /-|\n  |--|\n   \\-|";
var CHANGELOG_PAGE_DOWN_2 = "   /*|\n  |**|\n   \\*|";
var CHANGELOG_PAGE_UP_1 = " |-\\\n |--|\n |-/" ;
var CHANGELOG_PAGE_UP_2 = " |*\\\n |**|\n |*/";

//Кадры границ кнопок TOP
var TOP_1 = "//   ||                     ||                  ||              ||                                      ||   \\\\\n\\\\   ||                     ||                  ||              ||                                      ||   //";
var TOP_2 = "//   ||                                        Выйти  обратно                                           ||   \\\\\n\\\\   ||                                                                                                 ||   //";
var TOP_3 = "                                                  ЗАГРУЗКА";
//Кадры-рамки
var BORDER_1 = "====================================================================================================================\n||//                                                                                                            \\\\||\n||\\\\                                                                                                            //||\n====================================================================================================================\n||//                                                                                                            \\\\||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||                                                                                                                ||\n||\\\\                                                                                                            //||\n====================================================================================================================\n//                                                                                                                \\\\\n\\\\                                                                                                                //\n====================================================================================================================";

//Загрузка
var LOAD_BAR_BUTTON_1 = "\n                                                НАЧАТЬ ЗАГРУЗКУ";
var LOAD_BAR_BUTTON_2 = "///////////////////////////////////////////////////////////////////////////////////////////////////////////////\n////////////////////////////////////////////////НАЧАТЬ ЗАГРУЗКУ////////////////////////////////////////////////";

//Основная фоновая картинка
var MAIN_SCENE = "                 *            \\\\\n                             / \\\\_\n      *     __ __           /     \\\\\n          _/  ∆  \\_    *   /      /\\\\\n |\\\\____                         /  \\\\_\n |  ___ \\\\                      /      \\\\\n/  /   \\ \\\\                            /\\\\\n\\  \\___/  \\\\____      *             * /  \n |              \\\\             *     /\n |\\     ()    ___\\\\\n |/          /   ||   SIMBOL-ADVENTURE\n/            \\___||     ()        ()\n|      /\\        ||      \\  ____  /\n\\      \\/         \\\\      \\/°∆°\\\\/     *\n \\           ()    \\\\ *    \\___//\n__|_________________\\\\_____//_\\\\___________\n_____          /  ~      ~    \\\n  ~  \\  _–_    \\     ______    \\     _—_ \n___   \\         \\    \\    \\\\  ~ \\\n  \\\\   \\         \\  ~ \\    \\\\    \\\n   \\\\~  \\________/    /     \\\\  ~ \\_______\n_—_ \\\\      ~        / —_–   \\\\       ~\n     \\\\_____________/         \\\\__________";